package fundamentals.students_sream;

import fundamentals.students_sream.test.Tester;
import fundamentals.students_sream.test.Tester2;

public class Main {

    /*
    * СтудентыStream:
    * 1. Класс студента:
    * 	1.1 Имя
    * 	1.2 Фамилия
    * 	1.3 Отчестова
    * 	1.4 ФИО (подсказка: инкапсуляция)
    * 	1.5 Оценка
    * 2. При загрузке приложения запрашивать адрес файла из которого мы будем десериализовать
    *   данные о студентах.
    * 	2.1. Если ничего не указать то проверяется наличие файла students.bin
    *   относительно места запуска программы.
    * 	2.2. Если файл не найден то генерируем в указанное место файл.
    * 		2.2.1 При помощи Stream.generate() создать 10000 студентов
    * 		2.2.2 Сохранить в коллекцию
    * 		2.2.3 Коллекцию сохранить в файл
    * 			2.2.3.1 При помощи механизма сериализации в бинарный файл
    * 			2.2.3.2 При помощи сохранения каждого поля отдельно в текстовый файл
    * 3. Вывести top N по оценке, осортировать по имени
    * 4. Записать получившийся результат (топ N) в файл
    * 5. В новом классе прочитать этот файл и вывести последние N студентов.
     */

    public static void main(String[] args) {

        new Tester().run();
        new Tester2().run();

    }

}
